### SQL and SQLite

In [10]:
import sqlite3

In [11]:
# Connect to an SQLite database
connection = sqlite3.connect('example.db')
connection

In [12]:
cursor = connection.cursor()

In [13]:
# create table
cursor.execute('''
Create Table If Not Exists employees(
            id Integer Primary key,
            name Text Not Null,
            age Integer,
            department Text
            )
''')

# commit the changes
connection.commit()

In [14]:
cursor.execute('''
Select * from employees
''')

In [15]:
# Insert the data
cursor.execute('''
Insert Into employees
        (id, name, age, department) 
        Values
        (101, "Misbah", 21, "IT"),
        (102, "Krish", 21, "IT"),
        (103, "Amir", 21, "Hr"),
        (104, "Salman", 21, "IT"),
        (105, "Sharukh", 21, "Hr")
''')
connection.commit()

In [17]:
# retrive data
cursor.execute('''
Select * from employees
''')

rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'Misbah', 21, 'IT')
(102, 'Krish', 21, 'IT')
(103, 'Amir', 21, 'Hr')
(104, 'Salman', 21, 'IT')
(105, 'Sharukh', 21, 'Hr')

In [ ]:
# Update the table data
cursor.execute('''
Update employees
    Set age = 55
    Where name = 'Salman'
''')

connection.commit()

In [ ]:
# retrive data
cursor.execute('''
Select * from employees
''')

rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'Misbah', 21, 'IT')
(102, 'Krish', 21, 'IT')
(103, 'Amir', 21, 'Hr')
(104, 'Salman', 55, 'IT')
(105, 'Sharukh', 21, 'Hr')

In [ ]:
# delete the data from the table
cursor.execute('''
Delete from employees
    where name = 'Sharukh'
''') 

connection.commit()

In [22]:
# retrive data
cursor.execute('''
Select * from employees
''')

rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'Misbah', 21, 'IT')
(102, 'Krish', 21, 'IT')
(103, 'Amir', 21, 'Hr')
(104, 'Salman', 55, 'IT')

In [26]:
# working with sales data
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

connection.commit()

In [30]:
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product3', 300, 'East'),
    ('2023-01-04', 'Product4', 130, 'West'),
]
# insert data
cursor.executemany('''
INSERT INTO sales(date, product, sales, region)
            VALUES(?,?,?,?)
''', sales_data)
connection.commit()

In [31]:
# Query data
cursor.execute('''
SELECT * FROM sales
''')

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product3', 300, 'East')
(4, '2023-01-04', 'Product4', 130, 'West')

In [32]:
# close connection
connection.close()